; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_70)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj7 obj8 obj9 obj10 obj11 obj12 obj13 - truck
	obj5 obj6 - location
	obj14 obj15 obj16 obj17 obj18 obj19 obj21 - package
	obj20 - airplane
)

(:init
	(at obj4 obj0)
	(at obj7 obj2)
	(at obj8 obj2)
	(at obj9 obj2)
	(at obj10 obj0)
	(at obj11 obj2)
	(at obj12 obj0)
	(at obj13 obj2)
	(at obj14 obj2)
	(at obj15 obj0)
	(at obj16 obj2)
	(at obj17 obj2)
	(at obj18 obj0)
	(at obj19 obj2)
	(at obj20 obj0)
	(at obj21 obj2)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj5 obj3)
	(in-city obj6 obj1)
)

(:goal (and
	(at obj14 obj6)
	(at obj15 obj5)
	(at obj16 obj6)
	(at obj17 obj6)
	(at obj18 obj5)
	(at obj19 obj6)
	(at obj21 obj6)
))
)

; plan
1. (drive obj10 obj0 obj6)
   deleted: (at obj10 obj0)
   added: (at obj10 obj6)
   goals met: 0 of 7
2. (load obj20 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj20)
   goals met: 0 of 7
3. (load obj20 obj18 obj0)
   deleted: (at obj18 obj0)
   added: (in obj18 obj20)
   goals met: 0 of 7
4. (fly obj20 obj0 obj2)
   deleted: (at obj20 obj0)
   added: (at obj20 obj2)
   goals met: 0 of 7
5. (drive obj11 obj2 obj5)
   deleted: (at obj11 obj2)
   added: (at obj11 obj5)
   goals met: 0 of 7
6. (drive obj12 obj0 obj6)
   deleted: (at obj12 obj0)
   added: (at obj12 obj6)
   goals met: 0 of 7
7. (drive obj4 obj0 obj6)
   deleted: (at obj4 obj0)
   added: (at obj4 obj6)
   goals met: 0 of 7
8. (drive obj7 obj2 obj5)
   deleted: (at obj7 obj2)
   added: (at obj7 obj5)
   goals met: 0 of 7
9. (drive obj8 obj2 obj5)
   deleted: (at obj8 obj2)
   added: (at obj8 obj5)
   goals met: 0 of 7
10. (drive obj9 obj2 obj5)
   deleted: (at obj9 obj2)
   added: (at obj9 obj5)
   goals met: 0 of 7
11. (load obj20 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj20)
   goals met: 0 of 7
12. (load obj20 obj16 obj2)
   deleted: (at obj16 obj2)
   added: (in obj16 obj20)
   goals met: 0 of 7
13. (load obj20 obj17 obj2)
   deleted: (at obj17 obj2)
   added: (in obj17 obj20)
   goals met: 0 of 7
14. (load obj20 obj19 obj2)
   deleted: (at obj19 obj2)
   added: (in obj19 obj20)
   goals met: 0 of 7
15. (load obj20 obj21 obj2)
   deleted: (at obj21 obj2)
   added: (in obj21 obj20)
   goals met: 0 of 7
16. (unload obj20 obj15 obj2)
   deleted: (in obj15 obj20)
   added: (at obj15 obj2)
   goals met: 0 of 7
17. (unload obj20 obj18 obj2)
   deleted: (in obj18 obj20)
   added: (at obj18 obj2)
   goals met: 0 of 7
18. (fly obj20 obj2 obj0)
   deleted: (at obj20 obj2)
   added: (at obj20 obj0)
   goals met: 0 of 7
19. (drive obj10 obj6 obj0)
   deleted: (at obj10 obj6)
   added: (at obj10 obj0)
   goals met: 0 of 7
20. (drive obj11 obj5 obj2)
   deleted: (at obj11 obj5)
   added: (at obj11 obj2)
   goals met: 0 of 7
21. (drive obj13 obj2 obj5)
   deleted: (at obj13 obj2)
   added: (at obj13 obj5)
   goals met: 0 of 7
22. (drive obj4 obj6 obj0)
   deleted: (at obj4 obj6)
   added: (at obj4 obj0)
   goals met: 0 of 7
23. (drive obj7 obj5 obj2)
   deleted: (at obj7 obj5)
   added: (at obj7 obj2)
   goals met: 0 of 7
24. (unload obj20 obj14 obj0)
   deleted: (in obj14 obj20)
   added: (at obj14 obj0)
   goals met: 0 of 7
25. (unload obj20 obj16 obj0)
   deleted: (in obj16 obj20)
   added: (at obj16 obj0)
   goals met: 0 of 7
26. (unload obj20 obj17 obj0)
   deleted: (in obj17 obj20)
   added: (at obj17 obj0)
   goals met: 0 of 7
27. (unload obj20 obj19 obj0)
   deleted: (in obj19 obj20)
   added: (at obj19 obj0)
   goals met: 0 of 7
28. (unload obj20 obj21 obj0)
   deleted: (in obj21 obj20)
   added: (at obj21 obj0)
   goals met: 0 of 7
29. (fly obj20 obj0 obj2)
   deleted: (at obj20 obj0)
   added: (at obj20 obj2)
   goals met: 0 of 7
30. (drive obj11 obj2 obj5)
   deleted: (at obj11 obj2)
   added: (at obj11 obj5)
   goals met: 0 of 7
31. (drive obj12 obj6 obj0)
   deleted: (at obj12 obj6)
   added: (at obj12 obj0)
   goals met: 0 of 7
32. (drive obj8 obj5 obj2)
   deleted: (at obj8 obj5)
   added: (at obj8 obj2)
   goals met: 0 of 7
33. (load obj4 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj4)
   goals met: 0 of 7
34. (load obj4 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj4)
   goals met: 0 of 7
35. (load obj4 obj17 obj0)
   deleted: (at obj17 obj0)
   added: (in obj17 obj4)
   goals met: 0 of 7
36. (load obj4 obj19 obj0)
   deleted: (at obj19 obj0)
   added: (in obj19 obj4)
   goals met: 0 of 7
37. (load obj4 obj21 obj0)
   deleted: (at obj21 obj0)
   added: (in obj21 obj4)
   goals met: 0 of 7
38. (load obj7 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj7)
   goals met: 0 of 7
39. (load obj7 obj18 obj2)
   deleted: (at obj18 obj2)
   added: (in obj18 obj7)
   goals met: 0 of 7
40. (drive obj4 obj0 obj6)
   deleted: (at obj4 obj0)
   added: (at obj4 obj6)
   goals met: 0 of 7
41. (drive obj7 obj2 obj5)
   deleted: (at obj7 obj2)
   added: (at obj7 obj5)
   goals met: 0 of 7
42. (drive obj11 obj5 obj2)
   deleted: (at obj11 obj5)
   added: (at obj11 obj2)
   goals met: 0 of 7
43. (drive obj13 obj5 obj2)
   deleted: (at obj13 obj5)
   added: (at obj13 obj2)
   goals met: 0 of 7
44. (drive obj8 obj2 obj5)
   deleted: (at obj8 obj2)
   added: (at obj8 obj5)
   goals met: 0 of 7
45. (drive obj9 obj5 obj2)
   deleted: (at obj9 obj5)
   added: (at obj9 obj2)
   goals met: 0 of 7
46. (unload obj4 obj14 obj6)
   deleted: (in obj14 obj4)
   added: (at obj14 obj6)
   goals met: 1 of 7
47. (unload obj4 obj16 obj6)
   deleted: (in obj16 obj4)
   added: (at obj16 obj6)
   goals met: 2 of 7
48. (unload obj4 obj17 obj6)
   deleted: (in obj17 obj4)
   added: (at obj17 obj6)
   goals met: 3 of 7
49. (unload obj4 obj19 obj6)
   deleted: (in obj19 obj4)
   added: (at obj19 obj6)
   goals met: 4 of 7
50. (unload obj4 obj21 obj6)
   deleted: (in obj21 obj4)
   added: (at obj21 obj6)
   goals met: 5 of 7
51. (unload obj7 obj15 obj5)
   deleted: (in obj15 obj7)
   added: (at obj15 obj5)
   goals met: 6 of 7
52. (unload obj7 obj18 obj5)
   deleted: (in obj18 obj7)
   added: (at obj18 obj5)
   goals met: 7 of 7
